Repository: NEOSidekick/NEOSidekick.AiAssistant
Catalog: Resources/Private/Translations/*/BackendModule/Automations.xlf
Languages: de

# label
source: NEOSidekick Automations
de: NEOSidekick Automatisierungen

# description
source: Configure AI-powered automations for your content.
de: Konfiguriere KI-gestützte Automatisierungen für deine Inhalte.

# intro
source: Configure AI-powered automations for your content, by adding quality assurance features. All enabled automations will be executed after every publish to live and finish 1-2 minutes after the publish.
de: Konfiguriere KI-gestützte Automatisierungen für deine Inhalte, indem du Qualitätssicherungsfunktionen hinzufügst. Alle aktivierten Automatisierungen werden bei jeder Veröffentlichung nach "live" asynchron ausgeführt, und werden ein bis zwei Minuten nach der Veröffentlichung angewendet.

# currentlyEditing
source: Currently automations are applied for the site "{site}".
de: Aktuelle Automatisierungen werden für die Seite "{site}" angewendet.

# seoAutomations.title
source: On-Page SEO Automations
de: On-Page-SEO Automatisierungen

# seoAutomations.determineMissingFocusKeywords
source: Determine and set missing focus keywords on publication
de: Bei Veröffentlichungen fehlende Fokus-Keyword ermitteln und setzen.

# seoAutomations.redetermineExistingFocusKeywords
source: Re-determine existing focus keywords on publication
de: Bei Veröffentlichungen bestehende Fokus-Keyword neu ermitteln

# seoAutomations.generateEmptySeoTitles
source: Automatically create SEO titles on publication when empty
de: Bei Veröffentlichungen leere SEO-Titel automatisch erzeugen

# seoAutomations.generateEmptyMetaDescriptions
source: Automatically create meta descriptions on publication when empty
de: Bei Veröffentlichungen leere Meta-Beschreibungen automatisch generieren

# seoAutomations.regenerateExistingSeoTitles
source: Automatically regenerate existing SEO titles on publication
de: Bei Veröffentlichungen bestehende SEO-Titel automatisch neu generieren

# seoAutomations.regenerateExistingMetaDescriptions
source: Automatically regenerate existing meta descriptions on publication
de: Bei Veröffentlichungen bestehende Meta-Beschreibungen automatisch neu generieren

# approvalProcess.label
source: Approval process:
de: Freigabe:

# approvalProcess.approveAutomatically
source: Publish directly
de: Direkt veröffentlichen

# approvalProcess.requestViaEmail
source: Request via email
de: Per E-Mail anfragen

# approvalProcess.requestViaSlack
source: Request via Slack
de: Per Slack anfragen

# imageAltText.title
source: Image Alt Text Automation
de: Automatisierung für Bild-Alt-Texte

# imageAltText.intro
source: Automatically correct texts and maintain brand integrity.
de: Korrigiere Texte automatisch und bewahre die Markenintegrität.

# imageAltText.generateEmptyAltTexts
source: Automatically generate empty alternative texts for images on publication
de: Bei Veröffentlichungen leere Alternativ-Texte für Bilder automatisch generieren

# imageAltText.generateEmptyTitleTexts
source: Automatically generate empty title texts for images on publication
de: Bei Veröffentlichungen leere Titel-Texte für Bilder automatisch generieren

# imageAltText.approvalProcess
source: Approval process for SEO automations:
de: Freigabeprozess für SEO-Automationen:

# brandGuard.rules
source: Rules
de: Regeln

# brandGuard.defaultPrompt
source: Please correct the following text based on these rules. # Rules - Correct all spelling and grammar mistakes - Always write "Neos CMS" (never "NEOS")
de: Bitte korrigiere den folgenden Text anhand dieser Regeln. # Regeln - Korrigiere alle Rechtschreib- und Grammatikfehler - Schreibe immer "Neos CMS" (nie "NEOS")

# brandGuard.includeNeosidekickBriefing
source: Include NEOSidekick briefing in prompt
de: NEOSidekick Briefing im Prompt inkludieren

# brandGuard.approvalProcess
source: Approval process for Brand Guard:
de: Freigabeprozess für Brand Guard:

source: Save
de: Speichern

# noSite.title
source: No Site Detected
de: Keine Website erkannt

# noSite.message
source: The automations are site-specific, and we could not detect a site for the current hostname. Please check the following:
de: Die Automatisierungen sind website-spezifisch, und wir konnten für den aktuellen Hostnamen keine Website erkennen. Bitte prüfe Folgendes:

# noSite.checkDomainAssignment
source: Make sure your site has a domain assigned in the Neos backend (under Management > Sites)
de: Stelle sicher, dass deiner Website im Neos-Backend eine Domain zugewiesen ist (unter Verwaltung > Websites).

# noSite.accessViaDomain
source: Access the Neos backend using a hostname that is configured as a domain for one of your sites
de: Greife auf das Neos-Backend über einen Hostnamen zu, der als Domain für eine deiner Websites konfiguriert ist.
