Repository: NEOSidekick/NEOSidekick.AiAssistant
Catalog: Resources/Private/Translations/*/BackendModule/DocumentNode.xlf
Languages: de, fr

# title
source: The Essential Toolkit for Effective On-Page SEO
de: Das unverzichtbare Toolkit für effektives On-Page SEO
fr: Ta boîte à outils essentielle pour un SEO on-page performant

# intro
source: On-page SEO is a cornerstone of successful digital marketing. It ensures your content is not only visible but also compelling to search engines. Here’s a streamlined toolkit to enhance your content.
de: On-Page-SEO ist ein essenziell für erfolgreichen digitalen Marketings. Es stellt sicher, dass Ihr Inhalt nicht nur sichtbar, sondern auch für Suchmaschinen ansprechend ist. Hier effektive Tools, um Deine Seiten zu optimieren.
fr: Le SEO on-page est l’un des piliers d’un marketing digital réussi. Il permet à ton contenu d’être non seulement visible, mais aussi irrésistible pour les moteurs de recherche. Voici une boîte à outils simple et puissante pour booster tes pages.

# filterTypeExplanation
source: NEOSidekick can identify the most relevant pages for you and provide suggestions for each of these pages.
de: NEOSidekick kann für dich die relevantesten Seiten ermitteln, und dir für jeder dieser Seiten Vorschläge machen.
fr: NEOSidekick repère pour toi les pages les plus stratégiques et génère des recommandations ciblées pour chacune d’elles.

# startModule
source: Start generation for most important pages
de: Generierung für wichtigste Seiten starten
fr: Lancer la génération pour les pages les plus stratégiques

# error.configuration
source: This module is not configured correctly. Please consult the documentation!
de: Dieses Modul ist nicht korrekt konfiguriert. Bitte konsultiere die Dokumentation!
fr: Ce module n’est pas encore configuré correctement. Consulte la documentation pour terminer la configuration.

# error.noApiKey
source: This feature is not available in the free version of NEOSidekick. Sign up for a free trial at: https://neosidekick.com/en/pricing.
de: Diese Funktion ist in der kostenlosen Version von NEOSidekick nicht verfügbar. Registrieren Sie sich für eine kostenlose Testversion unter: https://neosidekick.com/preise.
fr: Cette fonctionnalité n’est pas incluse dans la version gratuite de NEOSidekick. Découvre tout son potentiel avec un essai gratuit sur : https://neosidekick.com/en/pricing.

# configuration.filter.custom
source: I know what I'm doing and would prefer to set individual filters
de: Ich weiß was ich tue, und möchte individuelle Filter setzen
fr: Je maîtrise le sujet et je préfère définir mes filtres moi‑même

# configuration.focusKeywordPropertyFilter.label
source: Restrict by focus keyword
de: Auf Fokus-Keyword einschränken
fr: Restreindre au mot-clé principal

# configuration.focusKeywordPropertyFilter.none
source: None
de: Ohne
fr: Aucun

# configuration.focusKeywordPropertyFilter.only-empty-focus-keywords
source: Only without focus keyword
de: Nur ohne Fokus-Keyword
fr: Seulement sans mot-clé principal

# configuration.focusKeywordPropertyFilter.only-existing-focus-keywords
source: Only with focus keyword
de: Nur mit Fokus-Keyword
fr: Seulement avec mot-clé principal

# configuration.seoPropertiesFilter.label
source: Restrict by SEO properties
de: Auf SEO-Eigenschaften einschränken
fr: Restreindre aux propriétés SEO

# configuration.seoPropertiesFilter.none
source: None
de: Ohne
fr: Aucun

# configuration.seoPropertiesFilter.only-empty-seo-titles-or-meta-descriptions
source: Only without seo title or meta description
de: Nur ohne SEO-Titel oder Meta-Beschreibung
fr: Seulement sans titre SEO ou méta-description

# configuration.seoPropertiesFilter.only-empty-seo-titles
source: Only without seo title
de: Nur ohne SEO-Titel
fr: Seulement sans titre SEO

# configuration.seoPropertiesFilter.only-empty-meta-descriptions
source: Only without meta description
de: Nur ohne Meta-Beschreibung
fr: Seulement sans méta-description

# configuration.seoPropertiesFilter.only-existing-seo-titles
source: Only with seo title
de: Nur mit SEO-Titel
fr: Seulement avec titre SEO

# configuration.seoPropertiesFilter.only-existing-meta-descriptions
source: Only with meta description
de: Nur mit Meta-Beschreibung
fr: Seulement avec méta-description

# configuration.nodeTypeFilter.label
source: Restrict to page type
de: Auf Seitentyp einschränken
fr: Restreindre au type de page

# configuration.nodeTypeFilter.all
source: All page types
de: Alle Seitentypen
fr: Tous les types de pages

# configuration.languageDimensionFilter.label
source: Select languages
de: Sprachen auswählen
fr: Sélectionner les langues

# configuration.languageDimensionFilter.all
source: All languages
de: Alle Sprachen
fr: Toutes les langues

# configuration.itemsPerPage.label
source: Number of generations per page
de: Anzahl der Generierungen pro Seite
fr: Nombre de générations par page

# configuration.workspace.label
source: Workspace (read and write)
de: Arbeitsbereich (lesen und schreiben)
fr: Espace de travail (lecture et écriture)

# configuration.action.autoGenerateEmptySeoTitles
source: Automatically generate empty SEO titles
de: Leere SEO-Titel automatisch generieren
fr: Générer automatiquement les titres SEO vides

# configuration.action.autoGenerateEmptyMetaDescriptions
source: Automatically generate empty meta descriptions
de: Leere Meta-Beschreibungen automatisch generieren
fr: Générer automatiquement les méta-descriptions vides

# configuration.action.autoGenerateExistingSeoTitles
source: Automatically regenerate existing SEO titles
de: Bestehende SEO-Titel automatisch neu generieren
fr: Régénérer automatiquement les titres SEO existants

# configuration.action.autoGenerateExistingMetaDescriptions
source: Automatically regenerate existing meta descriptions
de: Bestehende Meta-Beschreibungen automatisch neu generieren
fr: Régénérer automatiquement les méta-descriptions existantes

# configuration.action.autoGenerateEmptyAlternativeTexts
source: Automatically generate empty alternative texts for images
de: Leere Alternativ-Texte für Bilder automatisch generieren
fr: Générer automatiquement les textes alternatifs vides pour les images

# configuration.action.autoGenerateEmptyTitleTexts
source: Automatically generate empty title texts for images
de: Leere Titel-Texte für Bilder automatisch generieren
fr: Générer automatiquement les textes de titre vides pour les images

# configuration.action.autoGenerateExistingAlternativeTexts
source: Automatically regenerate existing alternative texts for images
de: Bestehende Alternativ-Texte für Bilder automatisch neu generieren
fr: Régénérer automatiquement les textes alternatifs existants pour les images

# configuration.action.autoGenerateExistingTitleTexts
source: Automatically regenerate existing title texts for images
de: Bestehende Titel-Texte für Bilder automatisch neu generieren
fr: Régénérer automatiquement les textes de titre existants pour les images

# listItem.label
source: Page »{0}«
de: Seite »{0}«

# configuration.imagePropertiesFilter.label
source: Restrict by image properties
de: Auf Bild-Eigenschaften einschränken
fr: Restreindre aux propriétés de l'image

# configuration.imagePropertiesFilter.none
source: None
de: Ohne
fr: Aucun

# configuration.imagePropertiesFilter.only-empty-alternative-text-or-title-text
source: Only without alternative text or title text
de: Nur ohne Alternativ-Text oder Titel-Text
fr: Seulement sans texte alternatif ou texte de titre

# configuration.imagePropertiesFilter.only-empty-alternative-text
source: Only without alternative text
de: Nur ohne Alternativ-Text
fr: Seulement sans texte alternatif

# configuration.imagePropertiesFilter.only-empty-title-text
source: Only without title text
de: Nur ohne Titel-Text
fr: Seulement sans texte de titre

# configuration.imagePropertiesFilter.only-existing-alternative-text
source: Only with alternative text
de: Nur mit Alternativ-Text
fr: Seulement avec texte alternatif

# configuration.imagePropertiesFilter.only-existing-title-text
source: Only with title text
de: Nur mit Titel-Text
fr: Seulement avec texte de titre

# configuration.languageDimensionFilter.syncLabel
source: automatic DeepL translation
fr: traduction automatique DeepL
