Repository: NEOSidekick/NEOSidekick.AiAssistant
Catalog: Resources/Private/Translations/*/AiModal.xlf
Languages: de

# modify-text-title
source: Revise text
de: Text überarbeiten

# create-text-title
source: Generate text with AI
de: Text mit AI generieren

# regenerate-text
source: Regenerate
de: Neu generieren

# apply-modify-text
source: Use text
de: Text übernehmen

# apply-create-text
source: Insert text
de: Text einfügen

# configured-button
source: Configured instruction
de: Konfigurierte Anweisung

# intro-button
source: Introduction
de: Einleitung

# page-conclusion-button
source: Page Conclusion
de: Seitenfazit

# rephrase-button
source: Rephrase
de: Umformulieren

# longer-button-short
source: Longer
de: Länger

# longer-button
source: Make it longer
de: Mach es länger

# shorter-button-short
source: Shorter
de: Kürzer

# shorter-button
source: Make it shorter
de: Mach es kürzer

# fix-text-button
source: Fix spelling
de: Rechtschreibung

# custom-prompt-button
source: Custom prompt
de: Eigene Anweisung

source: Change tone
de: Schreibstil ändern

source: Selected Text
de: Ausgewählter Text

source: New Text
de: Neuer Text

# custom-prompt-modify-placeholder
source: How should the text be changed?
de: Wie soll der Text geändert werden?

# custom-prompt-create-placeholder
source: Briefly describe what text you want and its length
de: Beschreibe kurz, welchen Text du in welcher Länge generieren möchtest

# disclaimer
source: GenAI models can make mistakes. Check important information.
de: GenAI-Modelle können Fehler machen. Überprüfen Sie wichtige Informationen.
