Repository: NEOSidekick/NEOSidekick.AiAssistant
Catalog: Resources/Private/Translations/*/Error.xlf
Languages: fr

source: This feature is not available in the free version of NEOSidekick. Sign up for a free trial at: https://neosidekick.com/en/pricing.
fr: Cette fonctionnalité n'est pas disponible dans la version gratuite de NEOSidekick. Inscris-toi pour un essai gratuit sur : https://neosidekick.com/en/pricing.

source: The NEOSidekick api key provided is not valid.
fr: La clé API pour NEOSidekick est incorrecte.

source: An error occurred while asking NEOSidekick: {0}
fr: NEOSidekick a rencontré un problème : {0}

source: The property does not have a valid image.
fr: La propriété ne contient pas d'image valide.

source: Could not fetch image object.
fr: L'objet image n'a pas pu être récupéré.

source: The given image does not have a correct url.
fr: L'URL de l'image est incorrecte.

source: An error occurred while trying to evaluate: {0}
fr: La configuration suivante n'a pas pu être évaluée : {0}

source: You cannot start two text generations at the same time.
fr: Tu ne peux pas lancer deux générations de texte en même temps.

source: Please do not use options.sidekick.onCreate.module anymore. Read the docs to find out about the new configuration.
fr: S'il te plaît, n'utilise plus la configuration options.sidekick.onCreate.module. Consulte la nouvelle syntaxe dans la documentation.

source: Please write a few words about how to create the text.
fr: Décris ce qui doit être créé comme nouveau texte.

source: An error occurred while fetching the items: {0}
fr: Une erreur est survenue lors de la récupération des entrées : {0}

source: An error occurred while persisting an item
fr: Une erreur est survenue lors de l'enregistrement d'une entrée

source: Unfortunately, the analysis took too long and led to a timeout, please try again.
fr: L'analyse a malheureusement pris trop de temps et a entraîné un délai d'attente, réessaie s'il te plaît.
