Repository: NEOSidekick/NEOSidekick.AiAssistant
Catalog: Resources/Private/Translations/*/FocusKeywordModule.xlf
Languages: de

# label
source: Focus-Keyword Generator
de: Fokus-Keywords Generator

# intro
source: TBD
de: Mit diesem Tool kannst du pro Seite ein Fokus-Keyword setzen. Das ist der erste Schritt um suchmaschienenoptimierte Seitentitel und Metabeschreibungen zu erstellen.

# description
source: TBD
de: Mit diesem Tool kannst du pro Seite ein Fokus-Keyword setzen. Das ist der erste Schritt um suchmaschienenoptimierte Seitentitel und Metabeschreibungen zu erstellen.

# error.configuration
source: This module is not configured correctly. Please consult the documentation!
de: Dieses Modul ist nicht korrekt konfiguriert. Bitte konsultiere die Dokumentation!

# error.noApiKey
source: This feature is not available in the free version of NEOSidekick. Sign up for a free trial at: https://neosidekick.com/en/pricing.
de: Diese Funktion ist in der kostenlosen Version von NEOSidekick nicht verfügbar. Registrieren Sie sich für eine kostenlose Testversion unter: https://neosidekick.com/preise.

# configuration.nodeTypeFilter.label
source: Restrict to page type
de: Auf Seitentyp einschränken

# configuration.nodeTypeFilter.all
source: All page types
de: Alle Seitentypen

# configuration.itemsPerPage.label
source: Number of generations per page
de: Anzahl der Generierungen pro Seite

# configuration.workspace.label
source: Workspace
de: Arbeitsbereich

# configuration.mode.label
source: Selection of pages
de: Auswahl der Seiten

# configuration.mode.only-empty
source: Only empty focus keywords
de: Nur leere Fokus-Keywords

# configuration.mode.only-existing
source: Only existing focus keywords
de: Nur bestehende Fokus-Keywords

# configuration.mode.both
source: All
de: Alle

# configuration.generateEmptyFocusKeywords.label
source: Generate empty focus keywords automatically
de: Leere Fokus-Keywords automatisch generieren

# configuration.regenerateExistingFocusKeywords.label
source: Regenerate existing focus keywords automatically
de: Bestehende Fokus-Keywords automatisch neu generieren

# listItem.label
source: Page »{0}«
de: Seite »{0}«

# listItem.notice
source: Our page content analysis points to the focus keyword "{0}". If this does not fit at all, customising the text for SEO could be helpful.
de: Unsere Seiten-Inhaltsanalyse deutet auf das Fokus-Keyword "{0}" hin. Falls dies gar nicht passt, könnte ein Anpassen des Textes für SEO hilfreich sein.

# listItem.checkSearchVolume
source: Check search volume:
de: Suchvolumen prüfen:
