Repository: NEOSidekick/NEOSidekick.AiAssistant
Catalog: Resources/Private/Translations/*/Module.xlf
Languages: fr

# label
source: NEOSidekick AI-Assistant
fr: Assistant IA NEOSidekick

source: Selection filter
fr: Filtre de sélection

# listEmpty
source: There are no items that match the filter!
fr: Il n'y a aucun résultat correspondant aux filtres !

# listEndReached
source: Congratulations. You have reached the end of the list. You have gone through {0} entries.
fr: Félicitations. Tu as atteint la fin de la liste. Tu as parcouru {0} entrées.

# listLimitReached
source: This tool can currently process a maximum of 10,000 entries at the same time. All your changes are saved, please start a new search.
fr: Cet outil peut actuellement traiter un maximum de 10 000 entrées simultanément. Toutes tes modifications sont enregistrées, lance une nouvelle recherche.

# error.configuration
source: This module is not configured correctly. Please consult the documentation!
fr: Ce module n'est pas configuré correctement. Consulte la documentation !

# error.noApiKey
source: This feature is not available in the free version of NEOSidekick. Sign up for a free trial at: https://neosidekick.com/en/pricing.
fr: Cette fonctionnalité n'est pas disponible dans la version gratuite de NEOSidekick. Inscris-toi pour un essai gratuit sur : https://neosidekick.com/en/pricing.

# saveAndNextPage
source: Save all and get next page
fr: Tout enregistrer et page suivante

source: Next page
fr: Page suivante

source: Discard
fr: Rejeter

# persist
source: Save
fr: Enregistrer

# persisted
source: Saved
fr: Enregistré

# persisting
source: Saving...
fr: Enregistrement...

source: Generating...
fr: Génération en cours...

source: Generate
fr: Générer

# startModule
source: Start generation
fr: Lancer la génération

source: Return to overview
fr: Retour à la vue d'ensemble

# slowLoadingMessage
source: Large websites sometimes take a few seconds to calculate the relevant content. Please be patient.
fr: Les grands sites web nécessitent parfois quelques secondes pour calculer le contenu pertinent. Merci de patienter un instant.

# slowLoadingMessage2
source: Please be patient a little longer. The query is still running. If an error occurs, you will see it here.
fr: Merci de patienter encore un peu. La requête est toujours en cours. Si une erreur survient, elle s'affichera ici.
